---
title: ModelText
classe: Autodesk.Revit.DB.ModelText
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ModelText

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Depth { get; set; }` | `modelText.Depth` | Double |
| `HorizontalAlign HorizontalAlignment { get; set; }` | `modelText.HorizontalAlignment` | HorizontalAlign |
| `Location Location { get; }` | `modelText.Location` | Location |
| `ModelTextType ModelTextType { get; set; }` | `modelText.ModelTextType` | ModelTextType |
| `Category Subcategory { get; set; }` | `modelText.Subcategory` | Category |
| `String Text { get; set; }` | `modelText.Text` | String |
| `FamilyElementVisibility GetVisibility()` | `modelText.GetVisibility()` | FamilyElementVisibility |
| `Void SetVisibility(FamilyElementVisibility)` | `modelText.SetVisibility(visibility)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```